# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [3]:
nos = pd.Series([4,8,15,16,23,42])
nos

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas. Series function on the variable print it

In [4]:
ls = [1,2,3,4,5,6,7,8,9,10]
nos2 = pd.Series(ls)
nos2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data: ... Then, print the DataFrame.

In [5]:
data = {'Name' : ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender' : ['Felmale', 'Male', 'Felmale']}
data_pandas = pd.DataFrame(data)
data_pandas

     Name  Age   Gender
0   Alice   25  Felmale
1     Bob   30     Male
2  Claire   27  Felmale

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrame can be thought of as a table or a spreadsheet, where the data is organized in rows and columns. On the other hand, a pandas Series is a one-dimensional labeled array that can also hold data of different types.

In [9]:
# DataFrame:
data_pandas

     Name  Age   Gender
0   Alice   25  Felmale
1     Bob   30     Male
2  Claire   27  Felmale

In [10]:
# Series:
data_pandas['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

`head()` and `tail()`: These functions allow you to view the first few rows (head()) or the last few rows (tail()) of a DataFrame. They are useful for inspecting the data and understanding its structure.

data = {'Name': ['John', 'Emily', 'Michael', 'Jessica', 'Eric'],
        'Age': [25, 30, 35, 28, 32],
        'City': ['New York', 'London', 'Paris', 'Sydney', 'Tokyo']}

df = pd.DataFrame(data)
# View the first 3 rows
print(df.head(3))

In [14]:
# View the last 2 rows
print(df.tail(2))

      Name  Age    City
3  Jessica   28  Sydney
4     Eric   32   Tokyo

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Among the options provided, both Series and DataFrame are mutable in nature, while Panel is not mutable.

# Q7. Create a DataFrame using multiple Series. Explain with an example

To create a DataFrame using multiple Series, you can combine the Series objects using the pd.concat() function or by passing them as a dictionary to the pd.DataFrame() constructor.

In [16]:
# Create Series objects
name_series = pd.Series(['John', 'Emily', 'Michael'])
age_series = pd.Series([25, 30, 35])
city_series = pd.Series(['New York', 'London', 'Paris'])

# Combine Series using pd.concat()
df_concat = pd.concat([name_series, age_series, city_series], axis=1)
print("DataFrame using pd.concat():")
print(df_concat)

DataFrame using pd.concat():
         0   1         2
0     John  25  New York
1    Emily  30    London
2  Michael  35     Paris

In [17]:
# Create DataFrame using dictionary
data = {'Name': name_series, 'Age': age_series, 'City': city_series}
df_dict = pd.DataFrame(data)
print("\nDataFrame using dictionary:")
print(df_dict)

DataFrame using dictionary:
      Name  Age      City
0     John   25  New York
1    Emily   30    London
2  Michael   35     Paris